laravel/app/Http/Controllers/API/BookController.php

    public function indexRequest(){

        try {
            $books = Book::where('request', 0)->get();
---
select * from `books` where `request` = 0

    public function updateRequestStatus($id, Request $request)
    {
        $this->validate($request, [
            'request' => 'required|in:0,1,2',
        ]);

        try {
            $book = Book::findOrFail($id);

            // Update the request status without checking permissions (for testing)
            $book->update([
                'request' => $request->input('request'),
                'status' => $request->input('request') == 1 ? 0 : 1,
            ]);
---
select * from `books` where `books`.`id` = '8' limit 1
update `books` set `status` = 0, `request` = '1', `books`.`updated_at` = '2023-12-22 12:43:52' where `id` = 8

    public function index ()
    {
        /*$books = Book::all();
        return response()->json([
            'status'=>200,
            'Products'=>$books
        ]);*/

         // Check if the authenticated user is an admin
            $isAdmin = Auth::check() && Auth::user()->role === 'admin';

            if ($isAdmin) {
                // Admin: Get all books
                $books = Book::all();
            } else {
                // Non-admin: Get books by the user's ID
                $userId = Auth::id();
                $books = Book::where('seller_id', $userId)->get();
---
select * from `books`
select * from `books` where `seller_id` = 7

    public function update (Request $request,$id){
        $validator = Validator ::make($request->all(),[
            'meta_title'=> 'required|max:191',
            'isbn'=> 'required|max:191',
            'category_id'=>'required|max:191',
            'book_title'=>'required|max:191',
            'cover_image'=>'required|image|mimes:jpeg,png,jpg|max:2048',
            'genre'=>'required|max:191',
            'selling_price'=>'required|max:191',
            'original_price'=>'required|max:191',
            'qty'=>'required|max:191',
            'description' =>'required|max:500',
        ]);

        if($validator -> fails()){
            return response()->json([
                'status'=> 422,
                'errors' => $validator -> messages(),
            ]);
        }
        else{

            $book = Book::find($id);
---
select * from `books` where `books`.`id` = '12' limit 1

    public function edit($id)
    {
        $book = Book::find($id);
---
select * from `books` where `books`.`id` = '13' limit 1