laravel/app/Http/Controllers/API/CategoryController.php

select * from `categories`
---
    public function index (){
        $category = Category::all();

select * from `categories` where `status` = '0'
---
    public function allcategory (){
        $category = Category::where('status','0')->get();