laravel/app/Http/Controllers/API/FrontendController.php

  public function viewBook($category,$id){

    $category = Category::where('slug',$category)->where('status','0')->first();
      if($category)
      {
        $book = Book::where('category_id',$category->id)
                      ->where('id',$id)
                      ->where('status','0')
                      ->first();
---
select * from `categories` where `slug` = 'informatique-internet-technologies-tendances-numeriques' and `status` = '0' limit 1
select * from `books` where `category_id` = 17 and `id` = '7' and `status` = '0' limit 1

    public function book($slug)
    {
      $category = Category::where('slug',$slug)->where('status','0')->first();
      if($category)
      {
        $book = Book::where('category_id',$category->id)->where('status','0')->get();
---
select * from `categories` where `slug` = 'entreprise-bourse-actualites-analyses-strategies-investissement' and `status` = '0' limit 1
select * from `books` where `category_id` = 10 and `status` = '0'

    public function indexSlider(){
      $bookP = Book::where('popular','1')->get();
      $bookF = Book::where('featured','1')->get();
---
select * from `books` where `popular` = '1'
select * from `books` where `featured` = '1'

    public function index(){
      $book = Book::where('status','0')->get();
---
select * from `books` where `status` = '0'