laravel/app/Http/Controllers/AuthController.php

select * from `users`
---
    public function updateProfile(Request $request): JsonResponse
    {
        $user = auth()->user();

        $data = $request->validate([
            'name' => 'required|string|max:191',
            'email' => ['required', 'email', 'max:191', Rule::unique('users', 'email')->ignore($user->id)],
            'phonenumber' => ['required', 'string', 'max:20', 'regex:/^\+?[0-9 ]{8,20}$/'],
            'password' => ['nullable', 'confirmed', Password::min(8)],
        ]);